travel/mexico-plans.org
#+TITLE: 
#+AUTHOR: 
#+DATE: 
#+OPTIONS: toc:nil H:2
#+LATEX_HEADER: \usepackage{tikzsymbols}

#+LATEX_HEADER: \usepackage{CJKutf8}
#+LATEX_HEADER: \newcommand{\ZH}[1]{\begin{CJK}{UTF8}{gbsn}\large #1\end{CJK}}
# +LATEX_HEADER: \newcommand{\ZHT}[1]{\begin{CJK}{UTF8}{bsmi}#1\end{CJK}}

* Yucatan
** Tue 11 Mar: Arrival to Cancun [0/3]
 + [ ] Landing 16:55;
 + [ ] Stay in Puerto Morelos https://maps.app.goo.gl/qLufWPHGQPjrKYhU6
 + [ ] Relax \Laughey[1.4]

** Wed 12 Mar: to Valladolid 2:20 [1/5]
 + [ ] Coba^? https://maps.google.com/?cid=14302297260168381406 or\\
       Ek Balam^? https://maps.google.com/?cid=3209123517850082809
 + [ ] Cenote Suytun https://maps.app.goo.gl/i2Pv3oNAkbiVZKedA
 + [ ] Cenote Zaci https://maps.app.goo.gl/VHvHxEDxAVv7R28j8 or \\
       Cenote Dzinup https://maps.app.goo.gl/92Zzc5UtwJiYHH588
 + [ ] Stay in Valladolid https://maps.google.com/?cid=14771480419104015041
 + [ ] ^? https://nochesdekukulkan.com.mx/evento/1 \\
   https://www.tripadvisor.co.uk/Attraction_Review-g150808-d8442736-Reviews-Chichen_Itza_Noche_de_Kukulkan-Chichen_Itza_Yucatan_Peninsula.html
   
** Thu 13 Mar: to Uxmal 2:40 [1/6]
 + [ ] Chichen Itza https://maps.google.com/?cid=8943762525109439898
 + [ ] Izamal https://maps.google.com/?cid=4654195024468678659
 + [ ] Temax \to Motul route https://maps.app.goo.gl/zxJLDm6cDGyUZ8iG9
 + [ ] Merida Gran Museo de Maya (closed)\\
       Merida Museo Regional de Antropología https://maps.google.com/?cid=5327836345381458369
 + [ ] Yaxcopoil https://maps.google.com/?cid=6353735009450878438
 + [ ] Stay in Muna https://maps.app.goo.gl/mM6AER3ThMhVtM5y5

** Fri 14 Mar: to Campeche 2:20  [1/6]
 + [ ] https://en.wikivoyage.org/wiki/Ruta_Puuc
 + [ ] Uxmal https://maps.google.com/?cid=77276175754351047
 + [ ] Kabah https://maps.google.com/?cid=7680299886271278365
 + [ ] Ticul pottery https://maps.google.com/?cid=5940936315111076429
 + [ ] Oxkutzcab citrus town https://maps.google.com/?cid=18395202836687022058
 + [ ] Xlapak
 + [ ] Stay in Campeche https://maps.google.com/?cid=12751977752877059312

** Sat 15 Mar: to Calakmul 4:00 [0/4]
 + [ ] Xmuch Garden https://maps.google.com/?cid=3533563304664637259
 + [ ] Museo de la Ciodad https://maps.google.com/?cid=10983723493102333969
 + [ ] Edzna https://maps.google.com/?cid=11460779793457169520
 + [ ] Becan https://maps.app.goo.gl/YUXBo6WFa1XeDktU7
 + [ ] Stay in Becan https://maps.google.com/?cid=17031082679048340135

** Sun 16 Mar:  Calakmul [0/3]
 + [ ] Calakmul (6:30 to 11:30) at Colhuas exit take the turn off to the site 
 + [ ] https://www.themayanruinswebsite.com/calakmul.html
 + [ ] Xpujil https://maps.app.goo.gl/1v5Bx9vqJmNgyV586

** Mon 17 Mar: to Mahahual 3:50 [0/2]
 + [ ] Kohunlich https://maps.google.com/?cid=8572165254962446644 or \\
       Ichkabal (close to Bacalar) https://maps.app.goo.gl/RdgsxrBVgF9kLMK8A or \\
       Dzibanché https://maps.google.com/?cid=576071547476253571
 + [ ] Museum of Mayan Culture https://maps.app.goo.gl/D4CuPPgKphxUTK3U9
 + [ ] El Pacer https://maps.app.goo.gl/6ggSwiMMEmHFm7Nr8
   
** Tue 18 Mar: Mahahual [0/2]
 + [ ] Snorkelling
 + [ ] Relax \Laughey[1.4]

** Wed 19 Mar: Mahahual [0/2]
 + [ ] Sian Ka'an Biosphere Reserve
 + [ ] Swimming with manatees

** Thu 20 Mar: Mahahual [0/0]
 + [ ] Swimming with turtles

* Mexico city
** Fri 21 Mar: To Cancun airport 4:50 [0/4]
 + [ ] CUN-NLU, 13:50-15:20
 + [ ] Staying at Plaza Santo Domingo
 + [ ] Centro Histórico: Palacio de Iturbide,
 + [ ] Catedral Metropolitana de México
 + [ ] Zocalo and Aztec dances

** Sat 22 Mar: Chapultepec, Roma [0/3]
 + [ ] Museo de Anthropologia https://maps.google.com/?cid=9521483601320789284
 + [ ] Museo Tamayo https://maps.google.com/?cid=3230234349847254610
 + [ ] Dinner at https://maps.app.goo.gl/YvLjVTTYuxwiyjxU9 or https://maps.app.goo.gl/c6x8zCnPWZvxKqsX9

** Sun 23 Mar: Del Carmen [0/3]
 + [ ] Frida Kahlo https://maps.google.com/?cid=7062107075614930081
 + [ ] Leon Trotsky https://maps.google.com/?cid=1208596980699922418
 + [ ] 

** Mon 24 Mar:  [0/4]
 + [ ] Zona Arquelógica Tlatelolco (Tlatelolco Archaeological Site) (entrance is on Lázaro Cárdenas) https://maps.google.com/?cid=1701952053221864427
 + [ ] Museo de Arte Popular, https://maps.google.com/?cid=2135336805215155084
 + [ ] Museo del Templo Mayor https://maps.google.com/?cid=10128805338444740272
 + [ ] Museum of Cultures https://maps.google.com/?cid=15938484738605529597
 + [ ] Palacio Nacional

** Tue 25 Mar: [0/3]
 + [ ] ^? Museo Soumaya https://maps.google.com/?cid=10624803107852467379
 + [ ] ^? Xochicalco + Cacahuamilpa https://maps.app.goo.gl/YTfWMkE5mdcYfyXdA 
 + [ ] 

*** Possible day away
 + [ ] Puebla: Cacaxtla or Cholula
 + [ ] Tula de Allende
 + [ ] Taxco: Cacahuamilpa caves and Xochicalco

** Wed 26 Mar: Flight to Cancun [0/3]
 + [ ] MEX-CUN, 09:55-13:30
 + [ ] Trip to Cancun if there is time
 + [ ] Flight to London, 18:40

* Food
** Mexican food [0/9]
    + [ ] Carne asada -- thin-cut marinated beef steak
    + [ ] Fajitas -- thinly sliced meat on a comal skillet
    + [ ] Fideo -- Tomato soup with short noodles
    + [ ] Menudo -- spicy stew made from tripe
    + [ ] Nopal -- (prickly pears) - edible cactus
    + [ ] Pozole -- nixtamalized maize and meat stew
    + [ ] Pulque -- fermented sap of the maguey (agave) plant
    + [ ] Tamales -- steamed rolls in cornmeal dough
    + [ ] Tasajo -- thin-cut beef steak or pork, partially cured
    + [ ] Tinga -- shredded meat in a smoky chipotle sauce

