travel/mexico-plans.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-02 Sun 13:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">

<div id="outline-container-org65e3cb9" class="outline-2">
<h2 id="org65e3cb9"><span class="section-number-2">1.</span> Yucatan</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org08fcb50" class="outline-3">
<h3 id="org08fcb50"><span class="section-number-3">1.1.</span> Tue 11 Mar: Arrival to Cancun <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Landing 16:55;</li>
<li class="off"><code>[&#xa0;]</code> Stay in Puerto Morelos <a href="https://maps.app.goo.gl/qLufWPHGQPjrKYhU6">https://maps.app.goo.gl/qLufWPHGQPjrKYhU6</a></li>
<li class="off"><code>[&#xa0;]</code> Relax \Laughey[1.4]</li>
</ul>
</div>
</div>

<div id="outline-container-orgde58810" class="outline-3">
<h3 id="orgde58810"><span class="section-number-3">1.2.</span> Wed 12 Mar: to Valladolid 2:20 <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Coba^? <a href="https://maps.google.com/?cid=14302297260168381406">https://maps.google.com/?cid=14302297260168381406</a> or<br />
Ek Balam^? <a href="https://maps.google.com/?cid=3209123517850082809">https://maps.google.com/?cid=3209123517850082809</a></li>
<li class="off"><code>[&#xa0;]</code> Cenote Zaci <a href="https://maps.app.goo.gl/VHvHxEDxAVv7R28j8">https://maps.app.goo.gl/VHvHxEDxAVv7R28j8</a> or <br />
Cenote Dzinup <a href="https://maps.app.goo.gl/92Zzc5UtwJiYHH588">https://maps.app.goo.gl/92Zzc5UtwJiYHH588</a></li>
<li class="off"><code>[&#xa0;]</code> Stay in Valladolid <a href="https://maps.google.com/?cid=14771480419104015041">https://maps.google.com/?cid=14771480419104015041</a></li>
<li class="off"><code>[&#xa0;]</code> ^? <a href="https://nochesdekukulkan.com.mx/evento/1">https://nochesdekukulkan.com.mx/evento/1</a> <br />
<a href="https://www.tripadvisor.co.uk/Attraction_Review-g150808-d8442736-Reviews-Chichen_Itza_Noche_de_Kukulkan-Chichen_Itza_Yucatan_Peninsula.html">https://www.tripadvisor.co.uk/Attraction_Review-g150808-d8442736-Reviews-Chichen_Itza_Noche_de_Kukulkan-Chichen_Itza_Yucatan_Peninsula.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8311d07" class="outline-3">
<h3 id="org8311d07"><span class="section-number-3">1.3.</span> Thu 13 Mar: to Uxmal 2:40 <code>[1/6]</code></h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Chichen Itza <a href="https://maps.google.com/?cid=8943762525109439898">https://maps.google.com/?cid=8943762525109439898</a></li>
<li class="off"><code>[&#xa0;]</code> Izamal <a href="https://maps.google.com/?cid=4654195024468678659">https://maps.google.com/?cid=4654195024468678659</a></li>
<li class="off"><code>[&#xa0;]</code> Temax &rarr; Motul route <a href="https://maps.app.goo.gl/zxJLDm6cDGyUZ8iG9">https://maps.app.goo.gl/zxJLDm6cDGyUZ8iG9</a></li>
<li class="off"><code>[&#xa0;]</code> Merida Gran Museo de Maya (closed)<br />
Merida Museo Regional de Antropología <a href="https://maps.google.com/?cid=5327836345381458369">https://maps.google.com/?cid=5327836345381458369</a></li>
<li class="off"><code>[&#xa0;]</code> Yaxcopoil <a href="https://maps.google.com/?cid=6353735009450878438">https://maps.google.com/?cid=6353735009450878438</a></li>
<li class="off"><code>[&#xa0;]</code> Stay in Muna <a href="https://maps.app.goo.gl/mM6AER3ThMhVtM5y5">https://maps.app.goo.gl/mM6AER3ThMhVtM5y5</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf4cc205" class="outline-3">
<h3 id="orgf4cc205"><span class="section-number-3">1.4.</span> Fri 14 Mar: to Campeche 2:20  <code>[1/6]</code></h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <a href="https://en.wikivoyage.org/wiki/Ruta_Puuc">https://en.wikivoyage.org/wiki/Ruta_Puuc</a></li>
<li class="off"><code>[&#xa0;]</code> Uxmal <a href="https://maps.google.com/?cid=77276175754351047">https://maps.google.com/?cid=77276175754351047</a></li>
<li class="off"><code>[&#xa0;]</code> Kabah <a href="https://maps.google.com/?cid=7680299886271278365">https://maps.google.com/?cid=7680299886271278365</a></li>
<li class="off"><code>[&#xa0;]</code> Ticul pottery <a href="https://maps.google.com/?cid=5940936315111076429">https://maps.google.com/?cid=5940936315111076429</a></li>
<li class="off"><code>[&#xa0;]</code> Oxkutzcab citrus town <a href="https://maps.google.com/?cid=18395202836687022058">https://maps.google.com/?cid=18395202836687022058</a></li>
<li class="off"><code>[&#xa0;]</code> Xlapak</li>
<li class="off"><code>[&#xa0;]</code> Stay in Campeche <a href="https://maps.google.com/?cid=12751977752877059312">https://maps.google.com/?cid=12751977752877059312</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3e81816" class="outline-3">
<h3 id="org3e81816"><span class="section-number-3">1.5.</span> Sat 15 Mar: to Calakmul 4:00 <code>[0/4]</code></h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Xmuch Garden <a href="https://maps.google.com/?cid=3533563304664637259">https://maps.google.com/?cid=3533563304664637259</a></li>
<li class="off"><code>[&#xa0;]</code> Museo de la Ciodad <a href="https://maps.google.com/?cid=10983723493102333969">https://maps.google.com/?cid=10983723493102333969</a></li>
<li class="off"><code>[&#xa0;]</code> Edzna <a href="https://maps.google.com/?cid=11460779793457169520">https://maps.google.com/?cid=11460779793457169520</a></li>
<li class="off"><code>[&#xa0;]</code> Becan <a href="https://maps.app.goo.gl/YUXBo6WFa1XeDktU7">https://maps.app.goo.gl/YUXBo6WFa1XeDktU7</a></li>
<li class="off"><code>[&#xa0;]</code> Stay in Becan <a href="https://maps.google.com/?cid=17031082679048340135">https://maps.google.com/?cid=17031082679048340135</a></li>
</ul>
</div>
</div>

<div id="outline-container-org697eb40" class="outline-3">
<h3 id="org697eb40"><span class="section-number-3">1.6.</span> Sun 16 Mar:  Calakmul <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Calakmul (6:30 to 11:30) at Colhuas exit take the turn off to the site</li>
<li class="off"><code>[&#xa0;]</code> <a href="https://www.themayanruinswebsite.com/calakmul.html">https://www.themayanruinswebsite.com/calakmul.html</a></li>
<li class="off"><code>[&#xa0;]</code> Xpujil <a href="https://maps.app.goo.gl/1v5Bx9vqJmNgyV586">https://maps.app.goo.gl/1v5Bx9vqJmNgyV586</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2409c00" class="outline-3">
<h3 id="org2409c00"><span class="section-number-3">1.7.</span> Mon 17 Mar: to Mahahual 3:50 <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Kohunlich <a href="https://maps.google.com/?cid=8572165254962446644">https://maps.google.com/?cid=8572165254962446644</a> or <br />
Ichkabal (close to Bacalar) <a href="https://maps.app.goo.gl/RdgsxrBVgF9kLMK8A">https://maps.app.goo.gl/RdgsxrBVgF9kLMK8A</a> or <br />
Dzibanché <a href="https://maps.google.com/?cid=576071547476253571">https://maps.google.com/?cid=576071547476253571</a></li>
<li class="off"><code>[&#xa0;]</code> Museum of Mayan Culture <a href="https://maps.app.goo.gl/D4CuPPgKphxUTK3U9">https://maps.app.goo.gl/D4CuPPgKphxUTK3U9</a></li>
<li class="off"><code>[&#xa0;]</code> El Pacer <a href="https://maps.app.goo.gl/6ggSwiMMEmHFm7Nr8">https://maps.app.goo.gl/6ggSwiMMEmHFm7Nr8</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb8914c6" class="outline-3">
<h3 id="orgb8914c6"><span class="section-number-3">1.8.</span> Tue 18 Mar: Mahahual <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Snorkelling</li>
<li class="off"><code>[&#xa0;]</code> Relax \Laughey[1.4]</li>
</ul>
</div>
</div>

<div id="outline-container-org1d89bf0" class="outline-3">
<h3 id="org1d89bf0"><span class="section-number-3">1.9.</span> Wed 19 Mar: Mahahual <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Sian Ka'an Biosphere Reserve</li>
<li class="off"><code>[&#xa0;]</code> Swimming with manatees</li>
</ul>
</div>
</div>

<div id="outline-container-org6351281" class="outline-3">
<h3 id="org6351281"><span class="section-number-3">1.10.</span> Thu 20 Mar: Mahahual <code>[0/0]</code></h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Swimming with turtles</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb4da3c0" class="outline-2">
<h2 id="orgb4da3c0"><span class="section-number-2">2.</span> Mexico city</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc769e5d" class="outline-3">
<h3 id="orgc769e5d"><span class="section-number-3">2.1.</span> Fri 21 Mar: To Cancun airport 4:50 <code>[0/4]</code></h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> CUN-NLU, 13:50-15:20</li>
<li class="off"><code>[&#xa0;]</code> Staying at Plaza Santo Domingo</li>
<li class="off"><code>[&#xa0;]</code> Centro Histórico: Palacio de Iturbide,</li>
<li class="off"><code>[&#xa0;]</code> Catedral Metropolitana de México</li>
<li class="off"><code>[&#xa0;]</code> Zocalo and Aztec dances</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8f5f0e" class="outline-3">
<h3 id="orgd8f5f0e"><span class="section-number-3">2.2.</span> Sat 22 Mar: Chapultepec, Roma <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Museo de Anthropologia <a href="https://maps.google.com/?cid=9521483601320789284">https://maps.google.com/?cid=9521483601320789284</a></li>
<li class="off"><code>[&#xa0;]</code> Museo Tamayo <a href="https://maps.google.com/?cid=3230234349847254610">https://maps.google.com/?cid=3230234349847254610</a></li>
<li class="off"><code>[&#xa0;]</code> Dinner at <a href="https://maps.app.goo.gl/YvLjVTTYuxwiyjxU9">https://maps.app.goo.gl/YvLjVTTYuxwiyjxU9</a> or <a href="https://maps.app.goo.gl/c6x8zCnPWZvxKqsX9">https://maps.app.goo.gl/c6x8zCnPWZvxKqsX9</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8e4337d" class="outline-3">
<h3 id="org8e4337d"><span class="section-number-3">2.3.</span> Sun 23 Mar: Del Carmen <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Frida Kahlo <a href="https://maps.google.com/?cid=7062107075614930081">https://maps.google.com/?cid=7062107075614930081</a></li>
<li class="off"><code>[&#xa0;]</code> Leon Trotsky <a href="https://maps.google.com/?cid=1208596980699922418">https://maps.google.com/?cid=1208596980699922418</a></li>
<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>

<div id="outline-container-orga999e16" class="outline-3">
<h3 id="orga999e16"><span class="section-number-3">2.4.</span> Mon 24 Mar:  <code>[0/4]</code></h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Zona Arquelógica Tlatelolco (Tlatelolco Archaeological Site) (entrance is on Lázaro Cárdenas) <a href="https://maps.google.com/?cid=1701952053221864427">https://maps.google.com/?cid=1701952053221864427</a></li>
<li class="off"><code>[&#xa0;]</code> Museo de Arte Popular, <a href="https://maps.google.com/?cid=2135336805215155084">https://maps.google.com/?cid=2135336805215155084</a></li>
<li class="off"><code>[&#xa0;]</code> Museo del Templo Mayor <a href="https://maps.google.com/?cid=10128805338444740272">https://maps.google.com/?cid=10128805338444740272</a></li>
<li class="off"><code>[&#xa0;]</code> Museum of Cultures <a href="https://maps.google.com/?cid=15938484738605529597">https://maps.google.com/?cid=15938484738605529597</a></li>
<li class="off"><code>[&#xa0;]</code> Palacio Nacional</li>
</ul>
</div>
</div>

<div id="outline-container-org07cb76b" class="outline-3">
<h3 id="org07cb76b"><span class="section-number-3">2.5.</span> Tue 25 Mar: <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> ^? Museo Soumaya <a href="https://maps.google.com/?cid=10624803107852467379">https://maps.google.com/?cid=10624803107852467379</a></li>
<li class="off"><code>[&#xa0;]</code> ^? Xochicalco + Cacahuamilpa <a href="https://maps.app.goo.gl/YTfWMkE5mdcYfyXdA">https://maps.app.goo.gl/YTfWMkE5mdcYfyXdA</a></li>
<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org1690a78"></a>Possible day away<br />
<div class="outline-text-4" id="text-2-5-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Puebla: Cacaxtla or Cholula</li>
<li class="off"><code>[&#xa0;]</code> Tula de Allende</li>
<li class="off"><code>[&#xa0;]</code> Taxco: Cacahuamilpa caves and Xochicalco</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org741cb2f" class="outline-3">
<h3 id="org741cb2f"><span class="section-number-3">2.6.</span> Wed 26 Mar: Flight to Cancun <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> MEX-CUN, 09:55-13:30</li>
<li class="off"><code>[&#xa0;]</code> Trip to Cancun if there is time</li>
<li class="off"><code>[&#xa0;]</code> Flight to London, 18:40</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org252f686" class="outline-2">
<h2 id="org252f686"><span class="section-number-2">3.</span> Food</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc49b76b" class="outline-3">
<h3 id="orgc49b76b"><span class="section-number-3">3.1.</span> Mexican food <code>[0/9]</code></h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Carne asada &#x2013; thin-cut marinated beef steak</li>
<li class="off"><code>[&#xa0;]</code> Fajitas &#x2013; thinly sliced meat on a comal skillet</li>
<li class="off"><code>[&#xa0;]</code> Fideo &#x2013; Tomato soup with short noodles</li>
<li class="off"><code>[&#xa0;]</code> Menudo &#x2013; spicy stew made from tripe</li>
<li class="off"><code>[&#xa0;]</code> Nopal &#x2013; (prickly pears) - edible cactus</li>
<li class="off"><code>[&#xa0;]</code> Pozole &#x2013; nixtamalized maize and meat stew</li>
<li class="off"><code>[&#xa0;]</code> Pulque &#x2013; fermented sap of the maguey (agave) plant</li>
<li class="off"><code>[&#xa0;]</code> Tamales &#x2013; steamed rolls in cornmeal dough</li>
<li class="off"><code>[&#xa0;]</code> Tasajo &#x2013; thin-cut beef steak or pork, partially cured</li>
<li class="off"><code>[&#xa0;]</code> Tinga &#x2013; shredded meat in a smoky chipotle sauce</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-02-02 Sun 13:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
